/*
	Виды ресурсов - Получение данных:
		* Текстура - SOIL
		* Меш - ASSIMP
		* Материал - ASSIMP
		* Шейдер - Native
		* Аудио - OpenAL
		* Источник света - ASSIMP
		* Камера - ASSIMP

		* Матемаические данные - GLM + Native
		* Текст - Native

		* Модель - ASSIMP
		* Анимация - ASSIMP
		* Сцена - ASSIMP
		
		* Группа - Create
		* Движок - Create
		
		* Графический вывод - GLFW
		* Ввод управления - GLFW
		* Аудио-вывод - OpenAL

		* Скрипт - ?
		* Шрифт - ?

	В понимании данного фреймворка:
		Шейдер - самостоятельный объект, который отвечает за процесс отрисовки объектов.
			В данный момент за фрагментную и вершинную обработку.
			Для корректной работы шейдера необходимо предоставить ему всю необходимую для отрисовки объекта информацию.
			Шейдер способен:
				* Выдавать информацию о расположении параметра в ogl шейдере (для загрузки информации "руками") - 
						Используется для данных, оличающихся для разных вызовов процедуры использования шейдера.
				* Автоматически загружать данные в параметр, при условии что объект был сериализован в
					UniformAutomaticInteface и был поставлен в очередь загрузки. -
						Используется для данных, совпадающих для разных вызовов процедуры использования шейдера.
				* Загружать код шейдера с диска и компилировать его в рабочую программу ogl

		Меш - совокупность наборов(массивов) данных:
				* координат (vertex);
				* полигонов (faces);
				* нормалей;
				* текстурных координат;
				* тангенсов;
				* битангенсов;
			У одной меши может быть много инстансов:
				Инстанс меши - хранилище данных, специфичных для определённой отрисовки данной меши (например данные о материале).
			Меш также хранит данные используемые всеми её инстансами.
			Меш заботится о:
				* Изначальном биндинге данных меши в VAO;
				* Управлении ресурсами, разделяемыми всеми инстансами;
				* Вызове функции использования шейдера (как следствие - загрузке всех зарегистрированых в очереди шедера данных);
				* Автоматической загрузке ресусрсов данного инстанса, при вызове его отрисовки;
				* Установке VAO;
				* Вызову функции отрисовки элементов (glDrawElements/glDrawArrays);
				* А также пока: управление текстурными ресурсами, привязанными к меши.

		Контроллер звука модели - объект, отвечающий за общение с аудио-движком


*/